//03_함수와인자전달.c
/*
인자전달
1) 값 전달		: 복사본 전달
2) 주소 전달	: 원본 전달
*/

#include <stdio.h>
/*
------------------------------------------
104번지			num2		20 -> 30
100번지			num1		10
------------------------------------------
[main stack]

*/
void fun1(int n1, int* n2);

void main()
{
	int num1 = 10;
	int num2 = 20;

	fun1(num1, &num2);	//값, 주소 전달

	printf("%d, %d\n", num1, num2);		//10, 30
}
/*
-------------------------------------------

204번지			n2			[104번지]
200번지			n1			10 -> 20
-------------------------------------------
[fun1 stack]
*/
void fun1(int n1, int* n2)
{
	n1 = 20;
	*n2 = 30;	//int = int 
}

